In [1]:
import pandas as pd

In [2]:
data={"Name":["a","b","c","d","a"],"Marks":[3,5,8,8,3],"RollNo":[3,6,9,8,3]}

In [3]:
df=pd.DataFrame(data)

In [4]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [5]:
df

  Name  Marks  RollNo
0    a      3       3
1    b      5       6
2    c      8       9
3    d      8       8
4    a      3       3

In [6]:
df.drop_duplicates()

  Name  Marks  RollNo
0    a      3       3
1    b      5       6
2    c      8       9
3    d      8       8

In [7]:
df

  Name  Marks  RollNo
0    a      3       3
1    b      5       6
2    c      8       9
3    d      8       8
4    a      3       3

In [8]:
df.drop_duplicates(inplace=True)

In [9]:
df

  Name  Marks  RollNo
0    a      3       3
1    b      5       6
2    c      8       9
3    d      8       8